## Mengimport Pandas dan Membaca CSV file

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("final_cars_datasets.csv")

## Dictionary dari Informasi-informasi yang didapat

In [3]:
dict_info = {}

dict_info["Jumlah Record"] = df.shape
dict_info["Nama_Attribute"] = list(df.columns)
dict_info["Attribute_Objek"] = list(df.select_dtypes(object))
dict_info["Attribute_Angka"] = list(df.select_dtypes(int,float).columns)

temp_dict = dict(df.isnull().any())
null_A = []
for key in temp_dict :
    if temp_dict[key] == True:
        null_A.append(key)
null_A
dict_info["Attribute_Null"]  = null_A

## Jumlah Record

In [4]:
print("Jumlah Record :",dict_info["Jumlah Record"])

Jumlah Record : (2318, 11)

## Nama Attributes

In [5]:
print("Nama Attribute :")

num = 1
for value in dict_info["Nama_Attribute"] :
    print(f"{num}.{value}")
    num += 1

Nama Attribute :
1.Unnamed: 0
2.price
3.mark
4.model
5.year
6.mileage
7.engine_capacity
8.transmission
9.drive
10.hand_drive
11.fuel

## Attributes Objek dan Jumlahnya

In [6]:
print("Attribute Objek :")

num = 1
for value in dict_info["Attribute_Objek"] :
    print(f"{num}.{value}")
    num += 1

print("\nJumlah Attribute Objek :",len(dict_info["Attribute_Objek"]))

Attribute Objek :
1.mark
2.model
3.transmission
4.drive
5.hand_drive
6.fuel

Jumlah Attribute Objek : 6

## Attributes Angka dan Jumlahnya

In [7]:
print("Attribute Angka :")

num = 1
for value in dict_info["Attribute_Angka"] :
    print(f"{num}.{value}")
    num += 1

print("\nJumlah Attribute Angka :",len(dict_info["Attribute_Angka"]))

Attribute Angka :
1.Unnamed: 0
2.price
3.year
4.mileage
5.engine_capacity

Jumlah Attribute Angka : 5

## Attributes Null dan Jumlahnya

In [8]:
print("Attribute Null :")

num = 1
for value in dict_info["Attribute_Null"] :
    print(f"{num}.{value}")
    num += 1

print("\nJumlah Attribute Null :",len(dict_info["Attribute_Null"]))

Attribute Null :

Jumlah Attribute Null : 0

## Menampilkan Rata-rata,std,nilai min, nilai max, Q1, Q2, Q3 dari attribute Angka

In [9]:
df.describe()

        Unnamed: 0        price         year        mileage  engine_capacity
count  2318.000000  2318.000000  2318.000000    2318.000000      2318.000000
mean   1169.047023   971.522433  2005.972390  100013.194996      1507.010785
std     674.460724   288.673112     3.698863   52512.478883       549.585170
min       0.000000    80.000000  1979.000000    2000.000000         9.000000
25%     583.250000   776.000000  2004.000000   67000.000000      1300.000000
50%    1168.500000  1000.000000  2006.000000   94000.000000      1490.000000
75%    1753.750000  1213.000000  2009.000000  124000.000000      1800.000000
max    2335.000000  1400.000000  2015.000000  790000.000000     12340.000000

## Nilai Kolerasi

In [10]:
df.corr()

C:\Users\Ardi Setyiawan\AppData\Local\Temp\ipykernel_12716\1134722465.py:1: FutureWarning: The default value of numeric_only in DataFrame.corr is deprecated. In a future version, it will default to False. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.corr()

                 Unnamed: 0     price      year   mileage  engine_capacity
Unnamed: 0         1.000000  0.985100 -0.188326  0.028091         0.169773
price              0.985100  1.000000 -0.211092  0.021581         0.173748
year              -0.188326 -0.211092  1.000000  0.086065        -0.142460
mileage            0.028091  0.021581  0.086065  1.000000         0.130362
engine_capacity    0.169773  0.173748 -0.142460  0.130362         1.000000

## Mengganti tipe data

<b>Sebelum</b>

In [11]:
df.dtypes

Unnamed: 0          int64
price               int64
mark               object
model              object
year                int64
mileage             int64
engine_capacity     int64
transmission       object
drive              object
hand_drive         object
fuel               object
dtype: object

In [12]:
df["price"] = df["price"].astype("float64")
df.round(decimals = 3)

,Unnamed: 0,price,mark,model,year,mileage,engine_capacity,transmission,drive,hand_drive,fuel
0,0,80.0,nissan,march,2003,80000,1240,at,2wd,rhd,gasoline
1,1,110.0,nissan,march,2010,53000,1200,at,2wd,rhd,gasoline
2,2,165.0,nissan,lafesta,2005,47690,2000,at,2wd,rhd,gasoline
3,3,190.0,toyota,avensis,2008,130661,1990,at,2wd,rhd,gasoline
4,4,190.0,daihatsu,mira,2006,66300,660,at,2wd,rhd,gasoline
...,...,...,...,...,...,...,...,...,...,...,...
2313,2331,1400.0,toyota,vitz,2009,121000,996,at,2wd,rhd,gasoline
2314,2332,1400.0,toyota,estima,2003,101000,3000,at,2wd,rhd,gasoline
2315,2333,1400.0,subaru,r2,2005,101000,660,cvt,2wd,rhd,gasoline
2316,2334,1400.0,honda,z,2000,170000,660,at,4wd,rhd,gasoline
2317,2335,1400.0,toyota,estima t,2005,72320,3000,at,2wd,rhd,gasoline

<b>Sesudah</b>

In [13]:
df.dtypes

Unnamed: 0           int64
price              float64
mark                object
model               object
year                 int64
mileage              int64
engine_capacity      int64
transmission        object
drive               object
hand_drive          object
fuel                object
dtype: object

## Menampilkan 10 Atrributes Bertipe Angka

In [14]:
df.select_dtypes(exclude=object).head(10)

   Unnamed: 0  price  year  mileage  engine_capacity
0           0   80.0  2003    80000             1240
1           1  110.0  2010    53000             1200
2           2  165.0  2005    47690             2000
3           3  190.0  2008   130661             1990
4           4  190.0  2006    66300              660
5           5  190.0  2004    81400              660
6           8  220.0  2010   117000             1200
7           9  230.0  2008   127763             3190
8          10  275.0  2010   178218             1800
9          11  283.0  2005   121655             2000

## Menyimpan Attribut Angka Ke CSV

In [16]:
df.select_dtypes(exclude = object).to_csv("Attribute_Angka.csv")